#                                          PANDAS ASSIGNMENT

In [91]:
import pandas as pd

In [92]:
#importing the csv document and assigning the dataset to a variable named Sales_data

In [93]:
Sales_data = pd.read_csv(r"C:\Users\HP\Downloads\messy_data.csv")

In [94]:
Sales_data

,TrnsnID,Data,CusmrID,ProdtID,ProdtName,Qutity,Prize,TtlSales,PaymentType,CusterAge
0,7402,03/17/2026,991,1045,Boo E,9,167.72,2935.06,NaN,87
1,5835,26-01-2035,741,1040,Book J,18,193.27,4386.52,debit card,69
2,2123,05/26/2035,933,1062,Bok N,5,126.39,1948.46,Cash,15
3,8789,28-02-2036,641,1060,Book I,6,66.98,1757.26,Cash,22
4,305,19-04-2023,123,1058,Book B,15,33.63,2578.19,Cash,-1
...,...,...,...,...,...,...,...,...,...,...
10095,5735,04/03/2027,52,1066,Book G,1,191.41,2788.25,Credit Card,91
10096,5192,08/16/2025,334,1093,Bok N,-2,186.16,1187.53,paypal,50
10097,5391,06/18/2026,657,1047,Bookk H,5,84.38,2119.76,debit card,63
10098,861,04/08/2034,579,1014,Bok N,19,137.58,1708.87,Debit,-7
10099,7271,26-04-2029,153,1052,Book T,10,159.98,2743.67,debit card,77

In [95]:
Sales_data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10100 entries, 0 to 10099
Data columns (total 10 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   TrnsnID      10100 non-null  int64
 1   Data         10100 non-null  object
 2   CusmrID      10100 non-null  int64
 3   ProdtID      10100 non-null  int64
 4   ProdtName    9098 non-null   object
 5   Qutity       10100 non-null  int64
 6   Prize        10100 non-null  float64
 7   TtlSales     10100 non-null  float64
 8   PaymentType  8645 non-null   object
 9   CusterAge    10100 non-null  int64
dtypes: float64(2), int64(5), object(3)
memory usage: 789.2+ KB

In [107]:
#To rename the columns

In [108]:
Sales_data.rename(columns={'TrnsnID':'TransactionID'}, inplace = True)

In [109]:
Sales_data.rename(columns={'Data':'Date'}, inplace = True)

In [110]:
Sales_data.rename(columns={'CusmrID':'CustomerID'}, inplace = True)

In [111]:
Sales_data.rename(columns={'ProdtID':'ProductID'}, inplace = True)

In [112]:
Sales_data.rename(columns={'ProdtName':'ProductName'}, inplace = True)

In [113]:
Sales_data.rename(columns={'Qutity':"Quantity"}, inplace = True)

In [114]:
Sales_data.rename(columns={'Prize':'Price'}, inplace = True)

In [115]:
Sales_data.rename(columns={'TtlSales':'TotalSales'}, inplace = True)

In [116]:
Sales_data.rename(columns={'TrnsnID':'TransactionID'}, inplace = True)

In [117]:
Sales_data.rename(columns={'CusterAge':'CustomerAge'}, inplace = True)

In [118]:
Sales_data

,TransactionID,Date,CustomerID,ProductID,ProductName,Quantity,Price,TotalSales,PaymentType,CustomerAge
0,7402,03/17/2026,991,1045,Boo E,9,167.72,2935.06,NaN,87
1,5835,26-01-2035,741,1040,Book J,18,193.27,4386.52,debit card,69
2,2123,05/26/2035,933,1062,Bok N,5,126.39,1948.46,Cash,15
3,8789,28-02-2036,641,1060,Book I,6,66.98,1757.26,Cash,22
4,305,19-04-2023,123,1058,Book B,15,33.63,2578.19,Cash,-1
...,...,...,...,...,...,...,...,...,...,...
10095,5735,04/03/2027,52,1066,Book G,1,191.41,2788.25,Credit Card,91
10096,5192,08/16/2025,334,1093,Bok N,-2,186.16,1187.53,paypal,50
10097,5391,06/18/2026,657,1047,Bookk H,5,84.38,2119.76,debit card,63
10098,861,04/08/2034,579,1014,Bok N,19,137.58,1708.87,Debit,-7
10099,7271,26-04-2029,153,1052,Book T,10,159.98,2743.67,debit card,77

In [120]:
#To convert the Date to datetime

In [123]:
Sales_data.Date = pd.to_datetime(Sales_data.Date, format = 'mixed')

In [124]:
Sales_data

,TransactionID,Date,CustomerID,ProductID,ProductName,Quantity,Price,TotalSales,PaymentType,CustomerAge
0,7402,2026-03-17,991,1045,Boo E,9,167.72,2935.06,NaN,87
1,5835,2035-01-26,741,1040,Book J,18,193.27,4386.52,debit card,69
2,2123,2035-05-26,933,1062,Bok N,5,126.39,1948.46,Cash,15
3,8789,2036-02-28,641,1060,Book I,6,66.98,1757.26,Cash,22
4,305,2023-04-19,123,1058,Book B,15,33.63,2578.19,Cash,-1
...,...,...,...,...,...,...,...,...,...,...
10095,5735,2027-04-03,52,1066,Book G,1,191.41,2788.25,Credit Card,91
10096,5192,2025-08-16,334,1093,Bok N,-2,186.16,1187.53,paypal,50
10097,5391,2026-06-18,657,1047,Bookk H,5,84.38,2119.76,debit card,63
10098,861,2034-04-08,579,1014,Bok N,19,137.58,1708.87,Debit,-7
10099,7271,2029-04-26,153,1052,Book T,10,159.98,2743.67,debit card,77

In [126]:
Sales_data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10100 entries, 0 to 10099
Data columns (total 10 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   TransactionID  10100 non-null  int64
 1   Date           10100 non-null  datetime64[ns]
 2   CustomerID     10100 non-null  int64
 3   ProductID      10100 non-null  int64
 4   ProductName    9098 non-null   object
 5   Quantity       10100 non-null  int64
 6   Price          10100 non-null  float64
 7   TotalSales     10100 non-null  float64
 8   PaymentType    8645 non-null   object
 9   CustomerAge    10100 non-null  int64
dtypes: datetime64[ns](1), float64(2), int64(5), object(2)
memory usage: 789.2+ KB

In [129]:
#To check for null or missing values

In [130]:
Sales_data.isnull().sum()

TransactionID       0
Date                0
CustomerID          0
ProductID           0
ProductName      1002
Quantity            0
Price               0
TotalSales          0
PaymentType      1455
CustomerAge         0
dtype: int64

In [131]:
#To fill in missing values using backward fill

In [134]:
Sales_data.fillna(method= 'bfill', inplace=True)

In [135]:
Sales_data.isnull().sum()

TransactionID    0
Date             0
CustomerID       0
ProductID        0
ProductName      0
Quantity         0
Price            0
TotalSales       0
PaymentType      0
CustomerAge      0
dtype: int64

In [136]:
#There are no more missing values in our Sales.data table

In [137]:
Sales_data.head(4)

,TransactionID,Date,CustomerID,ProductID,ProductName,Quantity,Price,TotalSales,PaymentType,CustomerAge
0,7402,2026-03-17,991,1045,Boo E,9,167.72,2935.06,debit card,87
1,5835,2035-01-26,741,1040,Book J,18,193.27,4386.52,debit card,69
2,2123,2035-05-26,933,1062,Bok N,5,126.39,1948.46,Cash,15
3,8789,2036-02-28,641,1060,Book I,6,66.98,1757.26,Cash,22

In [161]:
#To find out the unique entries in the PaymentType column using dataframe[column].unique() or  dataframe[column].nunique()
Sales_data['PaymentType'].nunique()

4

In [162]:
Sales_data['PaymentType'].unique()

array(['Debit Card', 'Cash', 'Credit Card', 'Paypal'], dtype=object)

To rename the entries in the PaymentType column

In [170]:
Sales_data['PaymentType'].replace({'debit card': 'Debit Card'}, inplace=True)

In [171]:
Sales_data['PaymentType'].replace({'Debit': 'Debit Card'}, inplace=True)

In [172]:
Sales_data['PaymentType'].replace({'Credit': 'Credit Card'}, inplace=True)

In [173]:
Sales_data['PaymentType'].replace({'paypal': 'Paypal'}, inplace=True)

In [174]:
Sales_data['PaymentType'].nunique()

4


To find out the unique entries in the ProductName column

In [176]:
Sales_data['ProductName'].unique()

array(['Boo E', 'Book J', 'Bok N', 'Book I', 'Book B', 'Book D', 'Book P',
       'Book M', 'Book O', 'Book T', 'Book A', 'Book G', 'Book R',
       'Book L', 'Book K', 'Book F', 'Bookk H', 'Book S'], dtype=object)

In [177]:
Sales_data['ProductName'].nunique()

18

To replace wrongly spelt entries in the ProductName Column

In [182]:
Sales_data['ProductName'].replace({'Boo E':'Book E'}, inplace=True)

In [183]:
Sales_data['ProductName'].replace({'Bok N':'Book N'}, inplace=True)

In [184]:
Sales_data['ProductName'].replace({'Bookk S':'Book S'}, inplace=True)

In [185]:
Sales_data['ProductName'].unique()

array(['Book E', 'Book J', 'Book N', 'Book I', 'Book B', 'Book D',
       'Book P', 'Book M', 'Book O', 'Book T', 'Book A', 'Book G',
       'Book R', 'Book L', 'Book K', 'Book F', 'Bookk H', 'Book S'],
      dtype=object)

In [186]:
Sales_data.head(10)

,TransactionID,Date,CustomerID,ProductID,ProductName,Quantity,Price,TotalSales,PaymentType,CustomerAge
0,7402,2026-03-17,991,1045,Book E,9,167.72,2935.06,Debit Card,87
1,5835,2035-01-26,741,1040,Book J,18,193.27,4386.52,Debit Card,69
2,2123,2035-05-26,933,1062,Book N,5,126.39,1948.46,Cash,15
3,8789,2036-02-28,641,1060,Book I,6,66.98,1757.26,Cash,22
4,305,2023-04-19,123,1058,Book B,15,33.63,2578.19,Cash,-1
5,2532,2032-08-19,185,1090,Book N,12,102.69,488.23,Cash,54
6,2996,2031-04-03,571,1086,Book D,15,176.27,4822.26,Cash,-4
7,7660,2031-02-27,172,1012,Book P,12,44.51,4966.85,Cash,82
8,8225,2026-05-26,342,1098,Book P,11,72.57,4920.76,Debit Card,51
9,4449,2030-02-05,614,1086,Book M,5,15.67,714.58,Debit Card,95